# Отримуємо трицифрове число від користувача
try:
    number = int(input("Введіть трицифрове число: "))

    # Перевіряємо, чи введене число є трицифровим
    if number < 100 or number > 999:
        raise ValueError("Число повинно бути трицифровим!")

    # Виділяємо першу цифру числа, використовуючи оператор цілочисельного ділення
    first_digit = number // 100

    # Виділяємо останню цифру числа, використовуючи оператор залишку від ділення
    last_digit = number % 10

    # Перевіряємо, чи співпадають перша і остання цифри
    if first_digit == last_digit:
        print("Число є паліндромом")
    else:
        print("Число не є паліндромом")
#Додаємо обробку помилки у випадку невірних данних
except ValueError as e:
    print(f"Помилка: {e}")
